In [1]:
import pandas as pd

In [2]:
tabela = pd.read_csv('../data/Matriculados.csv',  delimiter=';')

In [3]:
tabela.head()

    nome  idade  peso altura sexo
0  Maria     20    71   1,64    F
1  Pedro      8    33    1,2    M
2  Pablo     46    90    1,9    M
3  Joana     83    58   1,54    F

In [4]:
tabela['nome']

0    Maria
1    Pedro
2    Pablo
3    Joana
Name: nome, dtype: object

In [5]:
colunas = ['nome', 'peso']

In [7]:
colunas

['nome', 'peso']

In [6]:
tabela[colunas]

    nome  peso
0  Maria    71
1  Pedro    33
2  Pablo    90
3  Joana    58

In [7]:
tabela.iloc[:,:]

    nome  idade  peso altura sexo
0  Maria     20    71   1,64    F
1  Pedro      8    33    1,2    M
2  Pablo     46    90    1,9    M
3  Joana     83    58   1,54    F

In [8]:
tabela.iloc[1:,:]

    nome  idade  peso altura sexo
1  Pedro      8    33    1,2    M
2  Pablo     46    90    1,9    M
3  Joana     83    58   1,54    F

In [9]:
tabela.iloc[1:3,:]

    nome  idade  peso altura sexo
1  Pedro      8    33    1,2    M
2  Pablo     46    90    1,9    M

In [10]:
tabela.iloc[1:2,:]

    nome  idade  peso altura sexo
1  Pedro      8    33    1,2    M

In [11]:
tabela.iloc[2:,:]

    nome  idade  peso altura sexo
2  Pablo     46    90    1,9    M
3  Joana     83    58   1,54    F

In [12]:
tabela.iloc[:,:3]

    nome  idade  peso
0  Maria     20    71
1  Pedro      8    33
2  Pablo     46    90
3  Joana     83    58

In [19]:
tabela.iloc[1:3,1:3]

   idade  peso
1      8    33
2     46    90

In [13]:
n_filhos = [0, 0, 1, 2]

In [21]:
n_filhos

[0, 0, 1, 2]

In [18]:
tabela['n_filhos'] = n_filhos
tabela.head()

    nome  idade  peso altura sexo  n_filhos
0  Maria     20    71   1,64    F         0
1  Pedro      8    33    1,2    M         0
2  Pablo     46    90    1,9    M         1
3  Joana     83    58   1,54    F         2

In [17]:
tabela.drop(['n_filhos'], axis=0)

KeyError: "['n_filhos'] not found in axis"

In [24]:
tabela.drop(['n_filhos'], axis=1)

    nome  idade  peso  altura sexo
0  Maria     20    71    1.64    F
1  Pedro      8    33    1.20    M
2  Pablo     46    90    1.90    M
3  Joana     83    58    1.54    F

In [25]:
tabela.head()

    nome  idade  peso  altura sexo  n_filhos
0  Maria     20    71    1.64    F         0
1  Pedro      8    33    1.20    M         0
2  Pablo     46    90    1.90    M         1
3  Joana     83    58    1.54    F         2

In [27]:
tabela2 = tabela.drop(['n_filhos'], axis=1)
tabela2.head()

    nome  idade  peso  altura sexo
0  Maria     20    71    1.64    F
1  Pedro      8    33    1.20    M
2  Pablo     46    90    1.90    M
3  Joana     83    58    1.54    F

In [28]:
tabela.drop(['n_filhos'], axis=1, inplace=True)
tabela.head()

    nome  idade  peso  altura sexo
0  Maria     20    71    1.64    F
1  Pedro      8    33    1.20    M
2  Pablo     46    90    1.90    M
3  Joana     83    58    1.54    F